function populateElementsFromURL() {
  // Get the URL parameter value (replace "paramName" with your actual parameter)
  const parameterValue = new URLSearchParams(window.location.search).get("word");

  // Define data objects for different parameter values (modify as needed)
  const data = {
    "alligoria": {
      wordId: "word",
      wordValue: "Αλληγορία:",
      meaningId: "meaning",
      meaningValue: "(ἀλλ-ηγορέω: ἄλλος, ἀγορεύω): εκφραστικός τρόπος με τον οποίο ένα κείμενο κρύβει νοήματα διαφορετικά από εκείνα που φαίνεται ότι δηλώνει."
    },
    "anaxronismos": {
      wordId: "word",
      wordValue: "Αναχρονισμός:",
      meaningId: "meaning",
      meaningValue: "αναφορά γεγονότος σε άλλον -όχι στον αληθινό- χρόνο∙ ειδικότερα στην τέχνη, η χρησιμοποίηση ηθών και τρόπων κάποιας νεότερης εποχής για αναπαράσταση γεγονότων του παρελθόντος. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "apomnimonevma": {
      wordId: "word",
      wordValue: "Απομνημόνευμα:",
      meaningId: "meaning",
      meaningValue: "είδος αυτοβιογραφικού λόγου με το οποίο ο/η συγγραφέας αφηγείται σημαντικά, ιστορικά συνήθως, γεγονότα τα οποία είτε επηρέασε με τη δράση του είτε απλώς παρακολούθησε και τα θυμάται. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "astynomiki_logotexnia": {
      wordId: "word",
      wordValue: "Αστυνομική λογοτεχνία:",
      meaningId: "meaning",
      meaningValue: "λογοτεχνικό είδος με θέμα τη διάπραξη και ανίχνευση εγκληματικών ενεργειών. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "aftoviografia": {
      wordId: "word",
      wordValue: "Αυτοβιογραφία:",
      meaningId: "meaning",
      meaningValue: "ο απολογισμός της ζωής ενός προσώπου γραμμένος από το ίδιο αυτό πρόσωπο. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "afigimatikes_technikes": {
      wordId: "word",
      wordValue: "Αφηγηματικές τεχνικές:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται στο σύνολο των τεχνικών που χρησιμοποιούνται στον αφηγηματικό λόγο και οι οποίες σχετίζονται με τις κατηγορίες του αφηγηματικού χρόνου (των χρονικών σχέσεων μεταξύ αφήγησης και ιστορίας), της έγκλισης (των τρόπων της αφηγηματικής αναπαράστασης) και της φωνής. Πηγή: Τζούμα, Α. (1994). <i>Εισαγωγή στην αφηγηματολογία. Θεωρία και εφαρμογή της αφηγηματικής τυπολογίας του G. Genette.</i> Αθήνα: Πανεπιστημιακές Παραδόσεις."
    },
    "afigimatiki_diarkeia": {
      wordId: "word",
      wordValue: "Αφηγηματική διάρκεια:",
      meaningId: "meaning",
      meaningValue: "όρος της αφηγηματολογίας, που αναφέρεται στη σχέση ανάμεσα στη χρονική διάρκεια των γεγονότων μιας ιστορίας και στην έκταση που καταλαμβάνει η αφήγησή τους μέσα στο κείμενο. Πηγή:  Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "afigimatiki_foni": {
      wordId: "word",
      wordValue: "Αφηγηματική φωνή:",
      meaningId: "meaning",
      meaningValue: "ο αφηγητής, η «φωνή», δηλαδή, που αναλαμβάνει την ευθύνη της αφηγηματικής πράξης σε ένα αφηγηματικό κείμενο. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "afigimatiko_sxolio": {
      wordId: "word",
      wordValue: "Αφηγηματικό σχόλιο:",
      meaningId: "meaning",
      meaningValue: "όρος της αφηγηματολογίας που αναφέρεται σε σκέψη, κρίση, σχόλιο του αφηγητή. Εντάσσεται στην κατηγορία των αφηγηματικών τρόπων και λειτουργεί ως παύση που διακόπτει τη δράση."
    },
    "afigimatikoi_tropoi": {
      wordId: "word",
      wordValue: "Αφηγηματικοί τρόποι:",
      meaningId: "meaning",
      meaningValue: "δύο είναι οι βασικοί τρόποι με τους οποίους παρουσιάζεται από τον συγγραφέα η δράση: 1. ο αφηγητής περιγράφει τι συνέβη με δικές του λέξεις, ή αφηγείται τι σκέπτονται και αισθάνονται οι χαρακτήρες χωρίς παράθεση (περίληψη, telling, διήγηση). 2. άμεση παρουσίαση των λέξεων και των πράξεων των χαρακτήρων (σκηνική μέθοδος, showing, μίμηση). Επομένως, όροι όπως αφήγηση, περιγραφή, διάλογος, εσωτερικός μονόλογος, ελεύθερος πλάγιος λόγος, σχόλιο ανήκουν στους αφηγηματικούς τρόπους. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: Εκδόσεις Πατάκη."
    },
    "afigisi": {
      wordId: "word",
      wordValue: "Αφήγηση",
      meaningId: "meaning",
      meaningValue: "η διαδικασία του να λέει κανείς μια ιστορία αλλά και το προϊόν αυτής της διαδικασίας, το αφήγημα ή αφηγηματικό κείμενο. Πηγή: <i>Ψηφίδες για την ελληνική γλώσσα.</i>"
    },
    "genia_tou_70": {
      wordId: "word",
      wordValue: "Γενιά του ’70:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται σε ποιητές και ποιήτριες που έχουν γεννηθεί στο διάστημα 1940-1955, εμφανίζονται στα ελληνικά γράμματα τη δεκαετία του 1970 και των οποίων το έργο παρουσιάζει κοινά ιδεολογικά και αισθητικά γνωρίσματα."
    },
    "glossiko_zitima": {
      wordId: "word",
      wordValue: "Γλωσσικό ζήτημα:",
      meaningId: "meaning",
      meaningValue: "με τη δημιουργία του ελληνικού κράτους τέθηκε ζήτημα για το ποια μορφή της ελληνικής γλώσσας θα έπρεπε να διδάσκεται στο σχολείο και να αποτελεί επίσημη γλώσσα του κράτους. Το δίλημμα ανάμεσα στην καθαρεύουσα και στη δημοτική έπαψε να είναι μόνο γλωσσικό και εκπαιδευτικό, αλλά απέκτησε ευρύτερες πολιτικοκοινωνικές διαστάσεις διχάζοντας, κατά διαστήματα, την ελληνική κοινωνία. Πηγή: <i>Ψηφίδες για την ελληνική γλώσσα.</i>"
    },
    "diadromos_tis_syneidisis": {
      wordId: "word",
      wordValue: "Διάδρομος της συνείδησης:",
      meaningId: "meaning",
      meaningValue: "τεχνική εκπαιδευτικού δράματος, σύμφωνα με την οποία οι συμμετέχοντες/-ουσες στο δρώμενο δημιουργούν δύο παράλληλες σειρές σχηματίζοντας έναν διάδρομο, τον οποίο διασχίζει ένας «χαρακτήρας», ενώ ακούει τα υπόλοιπα μέλη της ομάδας να υποκρίνονται τις «φωνές» της συνείδησής του."
    },
    "diakeimenikotita": {
      wordId: "word",
      wordValue: "Διακειμενικότητα:",
      meaningId: "meaning",
      meaningValue: "όρος της Συγκριτικής Φιλολογίας που αφορά στην παρουσία ενός κειμένου μέσα σε ένα άλλο. Πηγή: Αντωνοπούλου, Α., Καρακάση, Α. & Πετροπούλου, Π. (2015). <i>Συγκριτολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "diaskelismos": {
      wordId: "word",
      wordValue: "Διασκελισμός:",
      meaningId: "meaning",
      meaningValue: "στιχουργικό φαινόμενο, όπου ο στίχος δεν χαρακτηρίζεται από νοηματική και συντακτική πληρότητα, αλλά το νόημά του συνεχίζεται στον επόμενο στίχο, όπως για παράδειγμα, στους στίχους του Ρ. Φιλύρα:<br/></p><p align=\"center\">τάμα στην ψυχή της<br/>που ʼκαμε μιʼ Αγία,</p><p>Πηγή: Μισιρλιάδη, Κ. (2022). <i>Ο διασκελισμός στον Φιλύρα και στον Σεφέρη.</i> Τμήμα Φιλολογίας. Τομέας Νεοελληνικής Φιλολογίας. ΕΚΠΑ [αδημοσίευτη διδακτορική διατριβή].</p>"
    },
    "dimotiki": {
      wordId: "word",
      wordValue: "Δημοτική:",
      meaningId: "meaning",
      meaningValue: "η μορφή της νεοελληνικής κοινής γλώσσας, όπως διαμορφώθηκε ιδίως τα τελευταία εκατόν πενήντα χρόνια από τον προφορικό λόγο του Nεοέλληνα και όπως καλλιεργήθηκε στη λογοτεχνία. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "eikona": {
      wordId: "word",
      wordValue: "Εικόνα:",
      meaningId: "meaning",
      meaningValue: "στη λογοτεχνία, μια εικόνα είναι άλλοτε μια όσο γίνεται πιο πιστή αναπαράσταση μιας αισθητής πραγματικότητας που ανακινεί συγκινήσεις, διεγείρει συναισθήματα, άλλοτε λειτουργεί όπως μια έμμεση αναπαράσταση ενός όντος ή πράγματος χωρίς να αναπαράγει με ακρίβεια την όψη του, και άλλοτε συνιστά τη θέαση μιας πραγματικότητας εσωτερικής, μια φανταστική αναπαράσταση. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: Εκδόσεις Πατάκη."
    },
    "eikonopoiia": {
      wordId: "word",
      wordValue: "Εικονοποιία:",
      meaningId: "meaning",
      meaningValue: "το σύνολο των εικόνων ενός ποιήματος ή του συνολικού έργου ενός ποιητή ή της ποίησης μιας περιόδου ή μιας σχολής. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: Εκδόσεις Πατάκη."
    },
    "eironia": {
      wordId: "word",
      wordValue: "Ειρωνεία:",
      meaningId: "meaning",
      meaningValue: "η έννοια εμφανίζεται και λειτουργεί στα λογοτεχνικά έργα με πολλαπλούς τρόπους (π.χ. ως σχήμα λόγου, ως ειρωνεία καταστάσεων). Σε κάθε όμως μορφή ειρωνείας υπάρχει μια ασυμφωνία μεταξύ λέξεων και νοήματος, πράξεων και αποτελεσμάτων, απατηλής και αντικειμενικής πραγματικότητας. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "eleftheros_plagios_logos": {
      wordId: "word",
      wordValue: "Ελεύθερος πλάγιος λόγος:",
      meaningId: "meaning",
      meaningValue: "αφηγηματική τεχνική με την οποία ο αφηγητής μεταφέρει λόγια, σκέψεις, συναισθήματα, διαθέσεις ενός άλλου προσώπου χωρίς να αλλάξει την τριτοπρόσωπη αφήγηση ούτε τον βασικό αφηγηματικό χρόνο. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "eleftheros_stixos": {
      wordId: "word",
      wordValue: "Ελεύθερος στίχος:",
      meaningId: "meaning",
      meaningValue: "στίχος που δεν υπακούει στους μετρικούς κανόνες της παραδοσιακής ποίησης: δεν έχει συγκεκριμένο μέτρο, δεν επιδιώκει ομοιοκαταληξία, δεν έχει συγκεκριμένο αριθμό συλλαβών, συνήθως συνοδεύεται από ελλιπή στίξη και διαταραγμένη σύνταξη. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "epanalipsi": {
      wordId: "word",
      wordValue: "Επανάληψη:",
      meaningId: "meaning",
      meaningValue: "σχήμα λόγου με το οποίο: α) μια λέξη ή φράση επαναλαμβάνεται αυτούσια ή με κάποιον συνώνυμο όρο (ταυτολογία), β) μια λέξη ή φράση επαναλαμβάνεται με κάποιον πρόσθετο προσδιορισμό (αναδίπλωση), γ) δύο ή περισσότερες διαδοχικές προτάσεις αρχίζουν με την ίδια λέξη ή φράση (επαναφορά), δ) μια λέξη ή φράση επαναλαμβάνεται στο τέλος διαδοχικών προτάσεων (επιστροφή ή αντιστροφή). Πηγή: Αθανασοπούλου, Α. (2022). <i>Σχήματα λόγου. Με παραδείγματα από κείμενα της ελλαδικής και κυπριακής λογοτεχνίας.</i> Αθήνα: Μεταίχμιο."
    },
    "eptanisiaki_scholi": {
      wordId: "word",
      wordValue: "Επτανησιακή Σχολή",
      meaningId: "meaning",
      meaningValue: "όρος της ιστορίας της νεοελληνικής λογοτεχνίας που έχει κατά καιρούς υποστεί αναθεωρήσεις∙ συμβατικά, αναφέρεται στη γραμματειακή παραγωγή Επτανήσιων δημιουργών κατά τη διάρκεια του 19ου αιώνα. Ένα από τα βασικά ζητήματα που έχουν απασχολήσει τη φιλολογική κριτική σε σχέση με τον συγκεκριμένο όρο είναι η θέση της σολωμικής ποίησης και η σχέση της με το έργο των άλλων Επτανήσιων ποιητών της περιόδου."
    },
    "estiasi": {
      wordId: "word",
      wordValue: "Εστίαση:",
      meaningId: "meaning",
      meaningValue: "η οπτική γωνία μέσα από την οποία δίνονται τα γεγονότα. (Στη μηδενική εστίαση, ο αφηγητής γνωρίζει περισσότερα από τον/τους χαρακτήρα/-ες, στην εσωτερική εστίαση, ο αφηγητής γνωρίζει όσα και ο/οι χαρακτήρας/-ες, ενώ στην εξωτερική εστίαση, ο αφηγητής γνωρίζει λιγοτερα από τον/τους χαρακτήρα/-ες)."
    },
    "esoterikos_monologos": {
      wordId: "word",
      wordValue: "Εσωτερικός μονόλογος:",
      meaningId: "meaning",
      meaningValue: "αφηγηματική τεχνική με την οποία ο/η αναγνώστης/-τρια έχει την εντύπωση ότι αποκτά αδιαμεσολάβητη και άμεση πρόσβαση στις σκέψεις και στην εσωτερική ζωή ενός χαρακτήρα. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "theatriki_pafsi": {
      wordId: "word",
      wordValue: "Θεατρική παύση:",
      meaningId: "meaning",
      meaningValue: "όρος που υποδεικνύει ότι πρόκειται να ακολουθήσει σιωπή. Η θεατρική παύση είναι σημαντικό δομικό στοιχείο της υποκριτικής τέχνης και συνήθως χρησιμοποιείται από τη διδασκαλία για έμφαση, για επιφύλαξη, για ετοιμασία επίθεσης ή ως μέριμνα άμυνας του ομιλούντος προσώπου. Πηγή: Γεωργουσόπουλος, Κ. (2006). «Οι γλώσσες της σιωπής». Εφημ. «Τα Νέα»."
    },
    "theatriko_analogio": {
      wordId: "word",
      wordValue: "Θεατρικό αναλόγιο:",
      meaningId: "meaning",
      meaningValue: "μορφή σκηνικής απόδοσης λογοτεχνικών και θεατρικών κειμένων. Χωρίς να είναι θεατρική παράσταση, έχει μεγάλη δόση θεατρικότητας δίνοντας προβάδισμα στο λόγο.<br/> Πηγή: <i>Οδηγός Εκπαιδευτικού για το Θέατρο</i> (2011). Παιδαγωγικό Ινστιτούτο. Υπουργείο Παιδείας και Διά Βίου Μάθησης."
    },
    "theatriko_dromeno": {
      wordId: "word",
      wordValue: "Θεατρικό δρώμενο (χάπενινγκ):",
      meaningId: "meaning",
      meaningValue: "θεατρική δράση με στοιχεία αυτοσχεδιασμού."
    },
    "iamvikos_dekapentasyllavos": {
      wordId: "word",
      wordValue: "Ιαμβικός δεκαπεντασύλλαβος:",
      meaningId: "meaning",
      meaningValue: "από τους πιο διαδεδομένους στίχους στη νεοελληνική ποίηση. Στην κλασική του μορφή αποτελείται από δύο ημιστίχια, ένα οκτασύλλαβο κι ένα επτασύλλαβο. Το μέτρο του είναι ο ίαμβος, ο συνδυασμός, δηλαδή, μιας άτονης και μιας τονισμένης συλλαβής (∪−). Πηγή: Σταύρου, Θ. (1992). <i>Νεοελληνική Μετρική.</i> Θεσσαλονίκη: Αριστοτέλειον Πανεπιστήμιον Θεσσαλονίκης. Ινστιτούτο Νεοελληνικών Σπουδών. Ίδρυμα Μανόλη Τριανταφυλλίδη."
    },
    "katharevousa": {
      wordId: "word",
      wordValue: "Καθαρεύουσα:",
      meaningId: "meaning",
      meaningValue: "τεχνητή μορφή της νεοελληνικής γλώσσας, μείγμα αρχαϊστικών και νεοελληνικών στοιχείων, που χρησιμοποιήθηκε ως επίσημη γλώσσα του ελληνικού κράτους. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "kare": {
      wordId: "word",
      wordValue: "Καρέ:",
      meaningId: "meaning",
      meaningValue: "τετράγωνο σχέδιο, αλλά και το μικρό πλαίσιο στα εικονογραφημένα αναγνώσματα και η στατική εικόνα στον κινηματογράφο. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "kalligramma": {
      wordId: "word",
      wordValue: "Καλλίγραμμα (ή καλλιγράφημα ή σχηματικό ποίημα):",
      meaningId: "meaning",
      meaningValue: "ποίημα γραμμένο με τέτοιο τρόπο, ώστε να σχηματίζει μια γραφική παράσταση, μια συγκεκριμένη εικόνα. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "kinimatografiki_metafora": {
      wordId: "word",
      wordValue: "Κινηματογραφική μεταφορά:",
      meaningId: "meaning",
      meaningValue: "ο όρος αφορά στη μεταφορά ενός λογοτεχνικού έργου στον κινηματογράφο. Από την πιο ελεύθερη διασκευή ως και την πιο πιστή προσαρμογή δεν μπορεί να υπάρξει ποτέ κατά λέξη μεταγραφή ενός αφηγηματικού κειμένου στον κινηματογράφο. Ο κινηματογραφιστής αντιμετωπίζει τη λογοτεχνική πηγή ως ένα πρότυπο, το οποίο μπορεί να ακολουθήσει πιστά ή να αλλάξει ριζικά. Πηγή: Μίγγα, Ν. (2019). <i>Η φιλοσοφία της αφήγησης από τον λόγο στην εικόνα: κινηματογραφικές μεταφορές νεοελληνικών πεζογραφημάτων για τον Εμφύλιο.</i> (Αδημοσίευτη διδακτορική διατριβή). Θεσσαλονίκη: Αριστοτέλειο Πανεπιστήμιο Θεσσαλονίκης (Α.Π.Θ.)."
    },
    "kolaz": {
      wordId: "word",
      wordValue: "Κολάζ:",
      meaningId: "meaning",
      meaningValue: "καλλιτεχνική σύνθεση που έχει γίνει με την τεχνική της επικόλλησης ετερόκλητων υλικών επάνω σε μία επιφάνεια, μερικές φορές σε συνδυασμό με μέρη ζωγραφισμένα ή σχεδιασμένα. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "limerik": {
      wordId: "word",
      wordValue: "Λίμερικ:",
      meaningId: "meaning",
      meaningValue: "Το λίμερικ είναι χιουμοριστικό (πολλές φορές σκωπτικό) ποιητικό είδος σταθερής μορφής, που αποτελείται από πέντε στίχους με ομοιοκαταληξία ααββα. Τις περισσότερες φορές ο πρώτος στίχος επαναλαμβάνεται ως τελευταίος. Το είδος συνδέεται με τον Edward Lear (A Book of Nonsense, 1843), ο οποίος συνόδευε τα ποιήματα με σκίτσα. Το είδος εισήγαγε στην Ελλάδα ο Γιώργος Σεφέρης, δίνοντάς του μάλιστα την ονομασία ληρολόγημα, που παραπέμπει αφενός στο όνομα του Edward Lear και αφετέρου στη λέξη «ληρολογώ». Πηγή: Διαμαντοπούλου, Λ. (2016). «Λογοτεχνικά γένη και είδη». Στο Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου,  Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "logotechnia_epistimonikis_fantasias": {
      wordId: "word",
      wordValue: "Λογοτεχνία επιστημονικής φαντασίας:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται σε λογοτεχνικά κείμενα που περιλαμβάνουν ταξίδια σε άλλους κόσμους, αναζητήσεις, εξερεύνηση του διαστήματος, επισκέψεις σε άλλους πλανήτες και διαπλανητικές συγκρούσεις. Τα έργα επιστημονικής φαντασίας σχετίζονται, επίσης, με την ανάπτυξη της τεχνολογίας και τις τεχνολογικές αλλαγές, με τα επιστημονικά πειράματα, καθώς και με την κοινωνική, κλιματολογική, γεωλογική και οικολογική αλλαγή. Μερικά αναφέρονται σε υπερφυσικές δυνάμεις και επιδράσεις. Είναι συχνά φανταστικά, αν και ενδέχεται να βασίζονται στην πραγματικότητα. Πηγή: Cuddon, J.A. (2005). <i>Λεξικό Λογοτεχνικών Όρων και Θεωρίας Λογοτεχνίας</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ). Αθήνα: Μεταίχμιο."
    },
    "logotechnia_tou_fantastikou": {
      wordId: "word",
      wordValue: "Λογοτεχνία του φανταστικού:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται σε λογοτεχνικά έργα το περιεχόμενο των οποίων αναπαριστά έναν κόσμο, όπου συμβαίνει ένα γεγονός που δεν μπορούν να το εξηγήσουν οι νόμοι του ίδιου αυτού οικείου κόσμου. Πηγή: Τοντόροφ, Τ. (1991). <i>Εισαγωγή στη φανταστική λογοτεχνία.</i> (Α. Παρίση, Μετ.). Αθήνα: Οδυσσέας."
    },
    "logotechniki_genia": {
      wordId: "word",
      wordValue: "Λογοτεχνική γενιά:",
      meaningId: "meaning",
      meaningValue: "ο ταξινομητικός αυτός όρος αναφέρεται σε ομάδα λογοτεχνών και διανοουμένων που είναι περίπου συνομήλικοι, έχουν δεχθεί κοινές επιδράσεις ή και βιώματα από την περιρρέουσα ατμόσφαιρα της εποχής τους, και το έργο τους παρουσιάζει κάποια κοινά χαρακτηριστικά ή κοινή αντίληψη για τον ρόλο και τη λειτουργία της τέχνης στη ζωή. Αν και εύχρηστος, έχει αμφισβητηθεί από νεότερους κριτικούς, που υποστηρίζουν ότι ο όρος οδηγεί σε υπερβολικούς χρονικά κατακερματισμούς της λογοτεχνικής παραγωγής, προκαλώντας ποικίλες συγχύσεις. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "logotechnikoi_charaktires": {
      wordId: "word",
      wordValue: "Λογοτεχνικοί χαρακτήρες:",
      meaningId: "meaning",
      meaningValue: "τα πρόσωπα που κινούνται μέσα στο μυθοπλαστικό σύμπαν ενός λογοτεχνικού έργου. Ως προς τη λειτουργία τους μέσα στην ιστορία, διακρίνονται σε πρωτεύοντες και δευτερεύοντες, με επιμέρους τύπους για καθεμία από τις παραπάνω κατηγορίες. Οι χαρακτήρες μαζί με την πλοκή και το σκηνικό είναι τα τρία βασικά αφηγηματικά στοιχεία της μυθοπλασίας. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: εκδόσεις Πατάκη."
    },
    "melopoiimeni_poiisi": {
      wordId: "word",
      wordValue: "Μελοποιημένη ποίηση:",
      meaningId: "meaning",
      meaningValue: "η πρόσληψη της ποίησης μέσα από τη μουσική οδηγεί σε ανασημασιοδότηση του ποιητικού λόγου. Αν και η ανάπτυξη της ποίησης υπήρξε στενά συνδεδεμένη με το τραγούδι, στη νεοελληνική λογοτεχνική και πολιτσμική ιστορία ο όρος αποκτά ιδιαίτερη δυναμική στην ελληνική δεκαετία του 1960 με τις μελοποιήσεις Ελλήνων ποιητών από τον Μίκη Θεοδωράκη. Πηγή: Παπανικολάου, Δ. (2012). Η μελοποιημένη ποίηση στη δεκαετία του ‘60. Στο Α. Καστρινάκη, Α. Πολίτης, Δ. Τζιόβας (Επιμ.), <i>Για μια Ιστορία της Ελληνικής Λογοτεχνίας του Εικοστού Αιώνα. Προτάσεις Ανασυγκρότησης, Θέματα, Ρεύματα.</i> Ηράκλειο: Πανεπιστημιακές Εκδόσεις Κρήτης / Μουσείο Μπενάκη."
    },
    "metapolemiki_poiisi": {
      wordId: "word",
      wordValue: "Μεταπολεμική ποίηση:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται στην ποιητική παραγωγή της μεταπολεμικής περιόδου (1944-1974). Επιμέρους υποδιαιρέσεις σε γενιές έχουν καθιερωθεί από τη λογοτεχνική κριτική (πρώτη μεταπολεμική γενιά, δεύτερη μεταπολεμική γενιά, γενιά του ’70, γενιά του ’80), όχι χωρίς αμφισβήτηση, με το επιχείρημα ότι τα όρια των λογοτεχνικών γενεών δεν είναι ευδιάκριτα ούτε απόλυτα στεγανοποιημένα. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "metafora": {
      wordId: "word",
      wordValue: "Μεταφορά:",
      meaningId: "meaning",
      meaningValue: "σχήμα λόγου με το οποίο η σημασία ενός πράγματος μεταφέρεται κατ’ αναλογίαν ως ιδιότητα σε ένα άλλο, μέσω μιας περισσότερο ή λιγότερο αισθητής ομοιότητας. Π.χ. η άνοιξη της ζωής, μαύρη ψυχή. Πηγή: Αθανασοπούλου, Α. (2022). <i>Σχήματα λόγου. Με παραδείγματα από κείμενα της ελλαδικής και κυπριακής λογοτεχνίας.</i> Αθήνα: Μεταίχμιο."
    },
    "metriki": {
      wordId: "word",
      wordValue: "Μετρική:",
      meaningId: "meaning",
      meaningValue: "μετρική ή στιχουργική είναι ο κλάδος της φιλολογίας που μελετά τους στιχουργικούς κανόνες, δηλαδή την ποικιλία και τον συνδυασμό των μέτρων στα οποία έχει συντεθεί ένα ποίημα ή μια ποιητική σύνθεση. H νεοελληνική μετρική στηρίζεται στον τονισμό (στην εναλλαγή τονισμένων και άτονων συλλαβών), γι’ αυτό ονομάζεται τονική και τα μέτρα της τονικά, ενώ η αρχαία ελληνική μετρική βασιζόταν στην προσωδία (τη διάκριση των συλλαβών, ορθότερα των φωνηέντων, σε μακρόχρονες και σε βραχύχρονες). Πηγή: Διαμαντοπούλου, Λ. (2016). «Νεοελληνική μετρική». Στο Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου, Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "metro": {
      wordId: "word",
      wordValue: "Μέτρο:",
      meaningId: "meaning",
      meaningValue: "το μέτρο είναι η μικρότερη μετρική μονάδα, δηλαδή το σύνολο από άρσεις και θέσεις (άτονες και τονισμένες συλλαβές) με την επανάληψη των οποίων σχηματίζεται ο στίχος. Στην αρχαιότητα το μέτρο λεγόταν πόδας (πους). Τα μέτρα της παραδοσιακής νεοελληνικής ποίησης δανείζονται την ονομασία τους από την αρχαία μετρική (ίαμβος, τροχαίος κ.λπ.), με τη διαφορά πως δεν ορίζονται από την προσωδία αλλά από την εναλλαγή τονισμένων και άτονων συλλαβών. Πηγή: Διαμαντοπούλου, Λ. (2016). «Νεοελληνική μετρική». Στο Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου, Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "mikrodiigima": {
      wordId: "word",
      wordValue: "Μικροδιήγημα:",
      meaningId: "meaning",
      meaningValue: "μικρό διήγημα, νανο-διήγημα, διήγημα μπονζάι είναι όροι που χρησιμοποιούνται τις τελευταίες δεκαετίες για να χαρακτηρίσουν μια ιδαίτερη αφηγηματική μορφή στο πεδίο της πεζογραφίας βασικό χαρακτηριστικό της οποίας είναι η συντομία. Πηγή: Αγγελάτος, Δ. (2016, Σεπτέμβριος 5). «Μικρό διήγημα / μικροδιήγημα / μπονζάι: ένα νέο είδος». Πλανόδιον."
    },
    "motivo": {
      wordId: "word",
      wordValue: "Μοτίβο:",
      meaningId: "meaning",
      meaningValue: "μία από τις κυρίαρχες ιδέες σε ένα λογοτεχνικό έργο∙ ένα μέρος του βασικού θέματος. Μπορεί να αποτελείται από έναν χαρακτήρα, μια εικόνα που επανέρχεται, ένα λεκτικό σχήμα. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "natouralismos": {
      wordId: "word",
      wordValue: "Νατουραλισμός:",
      meaningId: "meaning",
      meaningValue: "λογοτεχνικό κίνημα που εμφανίζεται στη Γαλλία μέσα στο δεύτερο μισό του 19ου αιώνα, με το πεζογραφικό έργο του É. Zola να έχει προεξάρχουσα θέση. Την ιδεολογία και αισθητική του νατουραλισμού σφράγισε η επιστημονική πρόοδος του 19ου αιώνα. Στη νατουραλιστική πεζογραφία κυριαρχούν θέματα που φανερώνουν την παθολογική πλευρά της κοινωνίας και του ατόμου (π.χ. εξαθλίωση λαϊκών στρωμάτων, αμάθεια, καταχρήσεις, απιστία, φθόνος, έγκλημα, πείνα κ.ά.), παρμένα από τη σύγχρονη ιστορική πραγματικότητα. Οι νατουραλιστές συγγραφείς, επίσης, ερμηνεύουν τα κίνητρα και τη συμπεριφορά των λογοτεχνικών χαρακτήρων –που προέρχονται από όλες τις κοινωνικές τάξεις– με βάση το περιβάλλον (φυσικό και κοινωνικό) και την κληρονομικότητα. Η ελληνική μετάφραση του μυθιστορήματος του É. Zola, Nana, το 1880, αποτελεί ορόσημο για την υποδοχή του νατουραλισμού στη νεοελληνική λογοτεχνία. Πηγή: Γαλαίος, Ι.Ε. (2011). <i>Ο νατουραλισμός και η νεοελληνική πεζογραφία (1880-1920). Θεωρία και πράξη.</i> (Αδημοσίευτη διδακτορική διατριβή). Αθήνα: ΕΚΠΑ."
    },
    "omoiokatalixia": {
      wordId: "word",
      wordValue: "Ομοιοκαταληξία:",
      meaningId: "meaning",
      meaningValue: "Η ηχητική ομοιότητα στο τέλος δύο ή περισσότερων στίχων λέγεται ομοιοκαταληξία ή ρίμα. Η ομοιοκαταληξία διακρίνεται σε οξύτονη (όταν η τελευταία λέξη του στίχου τονίζεται στη λήγουσα), παροξύτονη (όταν τονίζεται η προτελευταία συλλαβή του στίχου) ή προπαροξύτονη (όταν τονίζεται η προπαραλήγουσα της καταληκτικής λέξης του στίχου). Τα βασικά είδη ομοιοκαταληξίας είναι τα εξής: ζευγαρωτή (ααββ κ.λπ.), πλεχτή (αβαβ κ.λπ.), σταυρωτή (αββα κ.λπ.), ζευγαροπλεχτή (ααβγγβ κ.λπ.). Πηγή: Διαμαντοπούλου, Λ. (2016). «Νεοελληνική μετρική». Στο Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου, Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "pagomeni_eikona": {
      wordId: "word",
      wordValue: "Παγωμένη (ή ακίνητη) εικόνα:",
      meaningId: "meaning",
      meaningValue: "τεχνική εκπαιδευτικού δράματος, σύμφωνα με την οποία οι συμμετέχοντες/-ουσες, χρησιμοποιώντας τα σώματά τους, δημιουργούν μια εικόνα η οποία αποκρυσταλλώνει μια στιγμή της δράσης, ένα θέμα ή μια ιδέα. Πρέπει να τονιστεί ότι η ακίνητη εικόνα δεν είναι στατική, αλλά εμπεριέχει μια δυναμική. Πηγή: Αυδή, Α. και Χατζηγεωργίου, Μ. (2007). <i>Η τέχνη του Δράματος στην εκπαίδευση, 48 προτάσεις για εργαστήρια θεατρικής αγωγής.</i>  Αθήνα: Μεταίχμιο."
    },
    "palaia_athinaiki_scholi": {
      wordId: "word",
      wordValue: "Παλαιά Αθηναϊκή Σχολή:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται στη λογοτεχνική παραγωγή της περιόδου 1830-1880 με επίκεντρο την Αθήνα και βασικά γνωρίσματα τη χρήση της καθαρεύουσας και την επίδραση της ρομαντικής τεχνοτροπίας και του κλασικιστικού πνεύματος. Πηγή: Γαραντούδης, Ε. (2007). <i>Λεξικό της Νεοελληνικής Λογοτεχνίας. Πρόσωπα. Έργα. Ρεύματα. Όροι.</i> Αθήνα: εκδόσεις Πατάκη."
    },
    "pantognostis_afigitis": {
      wordId: "word",
      wordValue: "Παντογνώστης αφηγητής:",
      meaningId: "meaning",
      meaningValue: "ο αφηγητής που γνωρίζει ή, συγκεκριμένα, λέει περισσότερα απ’ ό,τι γνωρίζει ο ήρωας ή οποιοδήποτε πρόσωπο της δράσης. Πηγή: Τζούμα, Α. (1994). <i>Εισαγωγή στην αφηγηματολογία. Θεωρία και εφαρμογή της αφηγηματικής τυπολογίας του G. Genette.</i> Αθήνα: Πανεπιστημιακές Παραδόσεις."
    },
    "paralliles_skines": {
      wordId: "word",
      wordValue: "Παράλληλες σκηνές:",
      meaningId: "meaning",
      meaningValue: "οι μαθητές αναπαριστούν παράλληλα σκηνές, που στην ιστορία απέχουν χρονικά, στον ίδιο χώρο για να τις συσχετίσουν μεταξύ τους και να αναδείξουν τα αποτελέσματα που είχε η στάση των χαρακτήρων. Οι σκηνές μπορούν να εξελίσσονται ταυτόχρονα ή καθώς παίζεται η μία οι άλλες να παγώνουν. Πηγή: <i>Οδηγός Εκπαιδευτικού για το Θέατρο</i> (2011). Παιδαγωγικό Ινστιτούτο. Υπουργείο Παιδείας και Διά Βίου Μάθησης."
    },
    "paromoiosi": {
      wordId: "word",
      wordValue: "Παρομοίωση:",
      meaningId: "meaning",
      meaningValue: "σχήμα λόγου με το οποίο δύο διαφορετικά πράγματα συσχετίζονται μέσω μιας κοινής ιδιότητας, με το ομοιωματικό μόριο «σαν»/«ωσάν» ή με την περίφραση «όπως/καθώς… έτσι και…». Στην παρομοίωση, που στηρίζεται σε σύγκριση, είναι αναγκαίο να υπάρχουν και ο α΄και ο β΄ όρος σύγκρισης, καθώς και ο κοινός όρος σύγκρισης, δηλαδή το κριτήριο της ομοιότητας. Πηγή: Αθανασοπούλου, Α. (2022). <i>Σχήματα λόγου. Με παραδείγματα από κείμενα της ελλαδικής και κυπριακής λογοτεχνίας.</i> Αθήνα: Μεταίχμιο."
    },
    "ploki": {
      wordId: "word",
      wordValue: "Πλοκή:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται στη διάταξη των γεγονότων μιας ιστορίας. Η πλοκή, όπως και η ιστορία, είναι μια αφήγηση γεγονότων, στην οποία όμως η έμφαση που δίνεται δεν είναι χρονική αλλά αιτιακή. Έχουμε πλοκή όταν λέμε πώς το ένα γεγονός σχετίζεται με ένα άλλο γεγονός και πώς όλα μαζί αποδίδονται και οργανώνονται με τέτοιον τρόπο, ώστε να πετύχουν το ιδιαίτερο αποτέλεσμά τους. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: εκδόσεις Πατάκη."
    },
    "prosopopoiisi": {
      wordId: "word",
      wordValue: "Προσωποποίηση:",
      meaningId: "meaning",
      meaningValue: "σχήμα λόγου με το οποίο αποδίδονται ανθρώπινες ιδιότητες σε άψυχα ή σε αφηρημένες έννοιες. Πηγή: Αθανασοπούλου, Α. (2022). <i>Σχήματα λόγου. Με παραδείγματα από κείμενα της ελλαδικής και κυπριακής λογοτεχνίας.</i> Αθήνα: Μεταίχμιο."
    },
    "pyramida_freytag": {
      wordId: "word",
      wordValue: "Πυραμίδα Freytag:",
      meaningId: "meaning",
      meaningValue: "πυραμιδοειδές διάγραμμα που προτάθηκε τo 1863 από τον Γερμανό συγγραφέα και κριτικό Gustav Freytag ως πρότυπο σωστής πλοκής ενός θεατρικού έργου, και κυρίως μιας τραγωδίας. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "realismos": {
      wordId: "word",
      wordValue: "Ρεαλισμός:",
      meaningId: "meaning",
      meaningValue: "ο όρος αναφέρεται στην αισθητική τάση της λογοτεχνίας του 19ου αιώνα, η οποία στρέφει το ενδιαφέρον της προς την αντικειμενική αναπαράσταση της σύγχρονης πραγματικότητας και την αναζήτηση της αλήθειας. Στο πλαίσιο αυτό τα κύρια χαρακτηριστικά του ρεαλισμού γίνονται η παρατήρηση, η αντικειμενικότητα και η αληθοφάνεια. Η εμφάνιση του ρεαλισμού στην Ελλάδα γίνεται προς το τέλος του 19ου αιώνα με την υποχώρηση του ρομαντισμού  και την εμφάνιση της γενιάς του 1880. Πηγή: Βογιατζάκη, Ε. (2016). <i>Τα αισθητικά ρεύματα στην ευρωπαϊκή και τη νεοελληνική λογοτεχνία του 19ου και του 20ού αιώνα.</i> Αθήνα: Gutenberg."
    },
    "satira": {
      wordId: "word",
      wordValue: "Σάτιρα:",
      meaningId: "meaning",
      meaningValue: "ως αυτόνομο είδος λόγου η σάτιρα αφορά μόνο την αρχαιότητα∙ η μοντέρνα σάτιρα δεν συνιστά είδος αλλά ποιότητα λόγου και, εξαιτίας της ποικιλομορφίας της και του εύρους των τεχνικών που χρησιμοποιεί, η ταυτότητά της είναι δύσκολο να αποτυπωθεί σε έναν ορισμό. Το σημείο πάντως στο οποίο συμφωνούν οι διάφορες θεωρητικές προσεγγίσεις είναι ότι για να χαρακτηριστεί ένα λογοτεχνικό κείμενο σατιρικό πρέπει να συνδυάζει το χιούμορ με την κριτική. Πηγή: Κωστίου, Κ. «Η ειδολογική ταυτότητα της σάτιρας και τα συστατικά της». Σελιδοδείκτες για τη λογοτεχνία (selidodeiktes.greek-language.gr)."
    },
    "senario": {
      wordId: "word",
      wordValue: "Σενάριο:",
      meaningId: "meaning",
      meaningValue: "η γραπτή μορφή ενός κινηματογραφικού ή τηλεοπτικού έργου, που εκτός από την υπόθεση και τους διαλόγους περιέχει και όλες τις οδηγίες για τους τεχνικούς και για τους ηθοποιούς. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "skinikes_odigies": {
      wordId: "word",
      wordValue: "Σκηνικές οδηγίες:",
      meaningId: "meaning",
      meaningValue: "σημειώσεις που ενσωματώνονται ή προστίθενται στο κείμενο ενός θεατρικού έργου, προκειμένου να δείξουν τη στιγμή που εμφανίζεται κάποιο πρόσωπο, τον χαρακτήρα και τη συμπεριφορά του, το ύφος της απαγγελίας, τις κινήσεις των ηθοποιών, καθώς και λεπτομέρειες για τον χώρο, το σκηνικό και τα διάφορα θεατρικά τεχνάσματα. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "skiniko": {
      wordId: "word",
      wordValue: "Σκηνικό:",
      meaningId: "meaning",
      meaningValue: "οτιδήποτε συμβαίνει, συμβαίνει κάπου και κάποτε. Το σκηνικό ενός αφηγηματικού έργου αποτελείται από το γενικό φυσικό χωροχρονικό πλαίσιο, τον ιστορικό χρόνο και τις κοινωνικές συνθήκες μέσα στις οποίες διαδραματίζεται η ιστορία. Ο όρος, επομένως, αναφέρεται στο σημείο του χώρου και του χρόνου στο οποίο διαδραματίζονται τα επεισόδια. Πηγή: Αθανασόπουλος, Β. (2005). <i>Ιστορίες του κόσμου. Τρόποι της γραφής και της ανάγνωσης του οράματος.</i> Αθήνα: εκδόσεις Πατάκη."
    },
    "soneto": {
      wordId: "word",
      wordValue: "Σονέτο:",
      meaningId: "meaning",
      meaningValue: "ποίημα με σταθερή μορφή, προέρχεται από τα ιταλικά (όπου sonetto = μικρός ήχος) και έχει επίσης αποδοθεί στα ελληνικά με τον όρο «δεκατετράστιχο» (Παλαμάς), εφόσον βέβαια αποτελείται από δεκατέσσερις στίχους. Διακρίνονται δύο βασικές μορφές σονέτων: α) το ιταλικό ή Πετραρχικό σονέτο (δύο τετράστιχες στροφές με ομοιοκαταληξία αββα αββα και δύο τρίστιχες στροφές με ομοιοκαταληξία γδε γδε ή γδγ δγδ ή με άλλο, παρόμοιο συνδυασμό). Οι περισσότεροι Νεοέλληνες ποιητές ακολουθούν την Πετραρχική μορφή, κάποτε με παραλλαγές στην ομοιοκαταληξία∙ β) το αγγλικό ή σαιξπηρικό σονέτο (τρεις τετράστιχες στροφές με ομοιοκαταληξία αβαβ, γδγδ, εζεζ και ένα τελικό ομοιοκατάληκτο δίστιχο ηη). Οι ρίζες του σονέτου ανάγονται στην Ιταλία, με κύριους εκφραστές τον Πετράρχη και τον Δάντη. Υπό την επίδραση του Πετράρχη και των Πετραρχικών ποιητών γράφτηκαν τα Κυπριακά ερωτικά ποιήματα (16ος αιώνας)∙ γ) μια τρίτη, λιγότερο γνωστή, μορφή αντιπροσωπεύει το Σπενσεριανό σονέτο, που είναι παραλλαγή του σαιξπηρικού (τρεις τετράστιχες στροφές με ομοιοκαταληξία αβαβ, γδγ, εζεζ και ένα τελικό ομοιοκατάληκτο δίστιχο εε). Πηγή: Διαμαντοπούλου, Λ. (2016). «Λογοτεχνικά γένη και είδη». Στο Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου, Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "strofi": {
      wordId: "word",
      wordValue: "Στροφή:",
      meaningId: "meaning",
      meaningValue: "ομάδα δύο ή περισσότερων στίχων. Ο αριθμός των στίχων ανά στροφή προσδιορίζει και το όνομά της: έτσι, έχουμε στροφές δίστιχες, τρίστιχες (τερτσέτα), τετράστιχες (κουαρτέτα) κτλ. Ένα επίσης σημαντικό στοιχείο της στροφής είναι η μορφή της ομοιοκαταληξίας ή ο συνδυασμός των ειδών ομοιοκαταληξίας. Ο αριθμός των στίχων, η ομοιοκαταληξία και ο αριθμός των στροφών εξαρτάται ενίοτε από τη σταθερή μορφή του ποιήματος (π.χ. στο σονέτο). Ορισμένα ποιητικά κείμενα δεν είναι στροφικά, αλλά αποτελούνται από συμπλέγματα στίχων χωρίς φανερή μορφή ή ομαδοποίηση. Ειδικά σε ποιήματα με ελεύθερο στίχο, η κατανομή των στίχων στη σελίδα μπορεί να είναι αρκετά ελεύθερη, με κενά διαστήματα και ενότητες που διακρίνονται τυπογραφικά. Πηγή: Παππάς, Φ., Κατσιγιάννης, Α., & Διαμαντοπούλου,  Λ. <i>Εισαγωγή στη Νεοελληνική Φιλολογία.</i> Κάλλιπος, Ανοικτές Ακαδημαϊκές Εκδόσεις."
    },
    "symvolismos": {
      wordId: "word",
      wordValue: "Συμβολισμός:",
      meaningId: "meaning",
      meaningValue: "το 1886 ο ποιητής Jean Moréas (Ιωάννης Παπαδιαμαντόπουλος) δημοσιεύει στη γαλλική εφημερίδα Le Figaro το «Μανιφέστο του Συμβολισμού». Ο όρος αναφέρεται στο αισθητικό ρεύμα του συμβολισμού του 19ου αιώνα, με κύρια χαρακτηριστικά την αισθητική της αφαίρεσης, της απομάκρυνσης από την περιγραφή της εξωτερικής πραγματικότητας (χρόνου και τόπου) και του υλικού κόσμου, της υποβολής ιδεών και συναισθημάτων και της επικέντρωσης στη γλώσσα με ιδαίτερη έμφαση στην αξιοποιηση των ανεπαίσθητων μουσικών και ηχητικών ιδιοτήτων της. Πηγή: Βογιατζάκη, Ε. (2016). <i>Τα αισθητικά ρεύματα στην ευρωπαϊκή και τη νεοελληνική λογοτεχνία του 19ου και του 20ού αιώνα.</i> Αθήνα: Gutenberg."
    },
    "symvolo": {
      wordId: "word",
      wordValue: "Σύμβολο:",
      meaningId: "meaning",
      meaningValue: "με βάση την αρχαιοελληνική ετυμολογία του, το σύμβολο ήταν το ένα από τα δύο κομμάτια ενός αντικειμένου, το οποίο λειτουργούσε ως το αναμνηστικό της σχέσης μεταξύ δύο προσώπων («συμβαλλομένων»), κατά κανόνα ενός οικοδεσπότη και ενός φιλοξενούμενου. Κατά την αναχώρηση του τελευταίου, ο οικοδεσπότης διαμέλιζε ένα αντικείμενο στα δύο και πρόσφερε το ένα στον αναχωρητή, κρατώντας το άλλο ο ίδιος ως αποδεικτικό («σύμβολον») της φιλίας τους. (Πηγή: Πολυχρονάκης, Δ. (2016). «“Η ώρα των ποιητών”». Το Φθινόπωρο του Κωνσταντίνου Χατζόπουλου και η φθινοπωρινή αισθητική του συμβολισμού», επίμετρο στο Χατζόπουλος, Κ. Φθινόπωρο, Ηράκλειο: ΠΕΚ.) Στη λογοτεχνία, ο όρος «σύμβολο» χρησιμοποιείται για μια λέξη ή μια έκφραση που σημαίνει ένα αντικείμενο ή ένα γεγονός το οποίο με τη σειρά του σημαίνει κάτι άλλο ή παραπέμπει σε ένα φάσμα αναφορών πέραν του ιδίου. Ορισμένα σύμβολα είναι «συμβατικά» ή δημόσια: έτσι, «ο Σταυρός», «η Γαλανόλευκη» είναι όροι που αναφέρονται σε συμβολικά αντικείμενα η απώτερη σημασία των οποίων είναι καθορισμένη στο πλαίσιο μιας δεδομένης κουλτούρας. Οι ποιητές, όπως όλοι μας, μεταχειρίζονται τέτοιου είδους συμβατικά σύμβολα· πολλοί ποιητές, ωστόσο, χρησιμοποιούν επίσης «ιδιωτικά» ή «προσωπικά σύμβολα». Κάποιοι ποιητές χρησιμοποιούν επανειλημμένως σύμβολα που η σημασία τους είναι σε μεγάλο βαθμό δικής τους επινόησης, γεγονός που καθιστά δυσκολότερη την ερμηνεία τους. Πηγή: Abrams,  M.H. (2005). <i>Λεξικό λογοτεχνικών όρων</i> (Γ. Δεληβοριά, Σ. Χατζηιωαννίδου, Μετ.). Αθήνα: εκδόσεις Πατάκη. "
    },
    "syneirmos": {
      wordId: "word",
      wordValue: "Συνειρμός:",
      meaningId: "meaning",
      meaningValue: "στη λογοτεχνική κριτική, ο όρος συνδέεται με την άποψη ότι μία λέξη ή ιδέα μπορεί να λειτουργήσει ως ερέθισμα ή ως έναυσμα για μια σειρά ή μία ακολουθία λέξεων ή ιδεών που μπορεί να έχουν μια λογική σχέση με την αρχική, μπορεί και όχι. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "sxhmatiko_poiima": {
      wordId: "word",
      wordValue: "Σχηματικό ποίημα:",
      meaningId: "meaning",
      meaningValue: "βλ. «καλλίγραμμα»."
    },
    "scholi": {
      wordId: "word",
      wordValue: "Σχολή:",
      meaningId: "meaning",
      meaningValue: "ο όρος μπορεί να χρησιμοποιηθεί προκειμένου να χαρακτηρίσει ομάδα συγγραφέων που συνδέονται μεταξύ τους και σε γενικές γραμμές συμφωνούν ως προς τις βασικές αρχές πάνω στις οποίες βασίζονται τα έργα τους. Μια σχολή ενδέχεται να δημιουργήσει ένα κίνημα η επίδραση του οποίου εξαπλώνεται σε αρκετές χώρες. Πηγή: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο."
    },
    "tamplo_vivan": {
      wordId: "word",
      wordValue: "Ταμπλό βιβάν:",
      meaningId: "meaning",
      meaningValue: "αναπαράσταση μιας ιστορικής συνήθως σκηνής με ζωντανά ακίνητα πρόσωπα, ώστε να δίνουν την εντύπωση ζωγραφικού πίνακα. (Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>) Βλ. και «παγωμένη εικόνα»."
    },
    "tanka": {
      wordId: "word",
      wordValue: "Τάνκα:",
      meaningId: "meaning",
      meaningValue: "είδος ιαπωνικής λυρικής ποίησης. Αποτελείται από πέντε στίχους με την ακόλουθη δομή ως προς τον αριθμό των συλλαβών: 5-7-5 και 7-7. Στα τάνκα το βασικό θέμα είναι η ομορφιά της φύσης, όμως οι περισσότεροι στίχοι επιτρέπουν στο ποιητικό υποκείμενο να εκφράζει και τη συναισθηματική του κατάσταση. Πηγές: Cuddon, J. A. (2005). <i>Λεξικό λογοτεχνικών όρων και θεωρίας λογοτεχνίας.</i> (Γ. Παρίσης, Μ. Λιάπη, Μετ. – Επιστ. Επιμ.). Αθήνα: Μεταίχμιο. Σουλιώτης, Μ. (2012). <i>Δημιουργική γραφή – Οδηγίες πλεύσεως.</i> Υπουργείο Παιδείας και Πολιτισμού Κύπρου/Παιδαγωγικό Ινστιτούτο."
    },
    "tertsines": {
      wordId: "word",
      wordValue: "Τερτσίνες:",
      meaningId: "meaning",
      meaningValue: "τρίστιχες στροφές. Στην πρώτη στροφή του ποιήματος ο πρώτος και ο τρίτος στίχος ομοιοκαταληκτούν, σε καθεμία από τις άλλες στροφές ο πρώτος και ο τρίτος στίχος ομοιοκαληκτούν με τον δεύτερο της προηγούμενής τους στροφής. Το ποίημα το κλείνει ένας στίχος μονός, που ομοιοκαταληκτεί με τον μεσαίο της τελευταίας τρίστιχης στροφής. Για παράδειγμα, δίνεται το παρακάτω μέρος από χορικό της Ερωφίλης του Γ. Χορτάτση. Πηγή: Σταύρου, Θ. (1992). <i>Νεοελληνική Μετρική.</i> Θεσσαλονίκη: Αριστοτέλειον Πανεπιστήμιον Θεσσαλονίκης. Ινστιτούτο Νεοελληνικών Σπουδών. Ίδρυμα Μανόλη Τριανταφυλλίδη.<br/><br/><p align=\"center\">Διαμάντια καὶ ρουμπιά, μαργαριτάρια<br/>κι όλες τσι πέτρες τς άλλες μοναχός σου <br/>πως κάνεις, όλοι βλέπομε καθάρια. <br/><br/>Τά δέ θωρεί στη γη ποτὲ τὸ φώς σου, <br/>μα βρίσκουνται στα βάθη φυλαμένα, <br/>κι όσα κι άν είν’ ομπρός των αμματιώ σου, <br/><br/>γή εσὺ τα κάνεις όλα, γή απο σένα <br/>θρέφουνται και κρατιούνται και πληθαίνου, <br/>και να χαθή ποτέ μπορεί κιανένα; <br/><br/>Ήλιε μου φωτερέ, του περασμένου <br/>καιρού τα πάθη, πού ’χαμε, θυμούμαι <br/>κι ολόκρυγια τα μέλη μου απομένου.<br/><br/>Τσι ποταμούς πως είδαμε μπορούμε <br/>’ς τούτους τσι δόλιους τόπους τς εδικού μας <br/>να κυματίσουν αίματα να πούμε. <br/><br/>Τριγύρου στα τειχιά ’χαμε τς οχθρού μας…</p>"
    },
    "yperrealismos": {
      wordId: "word",
      wordValue: "Υπερρεαλισμός:",
      meaningId: "meaning",
      meaningValue: "ένα από τα κινήματα της περιόδου του ευρωπαϊκού μοντερνισμού (τέλη 19ου αιώνα έως περίπου και το πρώτο μισό του 20ού), με γενική επιδιωξη την αποδέσμευση από τα δεσμά της λογικής και από καθετί που περιόριζε την ελεύθερη δημιουργία. Δεν επεδίωξε το άρτιο αισθητικό αποτέλεσμα, αλλά την πρόκληση και την ανατροπή των παραδοσιακών μορφών. Πέρα από τη λογοτεχνία, ο υπερρεαλισμός επεκτάθηκε στη ζωγραφική, τη γλυπτική και τον κινηματογράφο. Το πρώτο μανιφέστο του κινήματος δημοσιεύτηκε το 1924 στη Γαλλία από τον André Breton. Οι ψυχαναλυτικές θεωρίες του Freud άσκησαν αποφασιστική επίδραση στον υπερρεαλισμό, ενώ η παράδοξη γλώσσα και η ονειρικής υφής εικονοποιία συνιστούν κύρια χαρακτηριστικά του. Πηγή: Βογιατζάκη, Ε. (2016). <i>Τα αισθητικά ρεύματα στην ευρωπαϊκή και τη νεοελληνική λογοτεχνία του 19ου και του 20ού αιώνα.</i> Αθήνα: Gutenberg."
    },
    "yfos": {
      wordId: "word",
      wordValue: "Ύφος:",
      meaningId: "meaning",
      meaningValue: "ο τρόπος με τον οποίο ένας συγκεκριμένος συγγραφέας μιλά για τα πράγματα. Η ανάλυση και η εκτίμηση του ύφους συνεπάγεται την εξέταση της επιλογής των λέξεων που κάνει ένας συγγραφέας, των σχημάτων λόγου που χρησιμοποιεί, των τεχνασμάτων (ρητορικών κ.ά.), της μορφής των προτάσεών του, της μορφής των παραγράφων –στην πραγματικότητα κάθε πιθανής πλευράς της γλώσσας του και του τρόπου με τον οποίο τη χρησιμοποιεί. Πηγή: <i>Λεξικό Κοινής Νεοελληνικής.</i>"
    },
    "xaikou": {
      wordId: "word",
      wordValue: "Χαϊκού:",
      meaningId: "meaning",
      meaningValue: "γιαπωνέζικη ποιητική μορφή που αποτελείται από δεκαεπτά συλλαβές κατανεμημένες σε στίχους των πέντε, επτά και πέντε συλλαβών αντίστοιχα. Τα ποιήματα αυτά εκφράζουν μια μόνο ιδέα, εικόνα ή συναίσθημα. Πηγή: Παρίσης, Ι., Παρίσης, Ν. <i>Λεξικό Λογοτεχνικών Όρων.</i> Υπουργείο Παιδείας, Θρησκευμάτων και Αθλητισμού/ΙΤΥΕ «ΔΙΟΦΑΝΤΟΣ»."
    },
    "xioumor": {
      wordId: "word",
      wordValue: "Χιούμορ:",
      meaningId: "meaning",
      meaningValue: "το χιούμορ βασίζεται στη διαφορά ανάμεσα στο πώς συμβαίνουν τα πράγματα και το πώς θα περιμέναμε να συμβούν: μια κατάσταση, μια ιδέα, ένα γεγονός έρχεται σε αντίθεση με όσα γνωρίζουμε για τον κόσμο που μας περιβάλλει, για την πραγματικότητα στην οποία ζούμε και τελικά σε αντίθεση με όσα περιμένουμε. Γι’ αυτό το χιούμορ συχνά συνδέεται με αυτό που στην κοινή γλώσσα ονομάζουμε ανατροπή ή έκπληξη. Πηγή: Βίλλυ Τσάκωνα «Χιούμορ». <i>Γλωσσάρι όρων γλωσσολογίας</i> στις Ψηφίδες για την Ελληνική γλώσσα (greek-language.gr)."
    },
    "conversation_poems": {
      wordId: "word",
      wordValue: "Conversation poems:",
      meaningId: "meaning",
      meaningValue: "δραστηριότητα δημιουργικής γραφής κατά την οποία πρέπει να συντεθεί από τους/τις ασκούμενους/-ες μια ποιητική δημιουργία, η οποία θα συνιστά τον αντίλογο στο αυθεντικό ποίημα που έχει τεθεί προς μελέτη. Έτσι, τα δύο κείμενα διαμορφώνουν μια ενότητα διαλόγου. Πηγή: Σουλιώτης, Μ. (2012). <i>Δημιουργική γραφή - Οδηγίες πλεύσεως.</i> Υπουργείο Παιδείας και Πολιτισμού Κύπρου/Παιδαγωγικό Ινστιτούτο."
    },
    "default": {
      wordId: "word",
      wordValue: "Δεν βρέθηκε η ζητούμενη λέξη",
      meaningId: "meaning",
      meaningValue: "-"
    }
  };

  // Check if the parameter value exists in the data object
  const elementData = data[parameterValue] || data["default"];

  // Update the element's content
  if (elementData) {
    const wordElement = document.getElementById(elementData.wordId);
    if (wordElement) {
      wordElement.innerHTML = elementData.wordValue;
    } else {
      console.error(`Element with ID "${elementData.wordId}" not found.`);
    }
  } else {
    console.warn(`No matching data found for parameter value "${parameterValue}".`);
  }

  // Update the element's content
  if (elementData) {
    const meaningElement = document.getElementById(elementData.meaningId);
    if (meaningElement) {
      meaningElement.innerHTML = elementData.meaningValue;
    } else {
      console.error(`Element with ID "${elementData.wordId}" not found.`);
    }
  } else {
    console.warn(`No matching data found for parameter value "${parameterValue}".`);
  }
}

// Call the function when the page loads
window.addEventListener("load", populateElementsFromURL);